IDEA Connection Link
ConnectionLink.OpenIdeaConnection Method (Byte[], Byte[], Byte[], Byte[], Byte[])
[Missing <summary> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void OpenIdeaConnection(
	byte[] iom,
	byte[] results,
	byte[] existingConProj,
	byte[] requiredTemplate,
	byte[] importSettings
)
Public Sub OpenIdeaConnection (
	iom As Byte(),
	results As Byte(),
	existingConProj As Byte(),
	requiredTemplate As Byte(),
	importSettings As Byte()
)
public:
virtual void OpenIdeaConnection(
	array<unsigned char>^ iom,
	array<unsigned char>^ results,
	array<unsigned char>^ existingConProj,
	array<unsigned char>^ requiredTemplate,
	array<unsigned char>^ importSettings
) sealed
Parameters
iom
Type: System.Byte[]
[Missing <param name="iom"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
results
Type: System.Byte[]
[Missing <param name="results"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
existingConProj
Type: System.Byte[]
[Missing <param name="existingConProj"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
requiredTemplate
Type: System.Byte[]
[Missing <param name="requiredTemplate"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
importSettings
Type: System.Byte[]
[Missing <param name="importSettings"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])"]
Implements
IAppController.OpenIdeaConnection(Byte[], Byte[], Byte[], Byte[], Byte[])
See Also
Reference
ConnectionLink Class
OpenIdeaConnection Overload
IdeaRS.ConnectionLink Namespace